[
  {
    "id": 1671166800,
    "titleUrl": "solo-travel-guided-tour-or-solo-travel",
    "titleString": "Solo travel guided tour? Or solo travel?\r",
    "author": "Nadia Greco\r",
    "date": "December 16, 2022\r",
    "image": "example2.jpg\r",
    "content": "\r\nSo you're thinking about solo travelling?\r\n\r\nMy solo travels have involved a combination of group-guided solo travel and trips where I've hopped on a plane and wandered blindly into a new country.\r\n\r\nBoth options have their benefits and it really comes down to the overall balance YOU are trying to achieve in your travelling and the many factors involved (safety, finances, freedom, convenience, etc).\r\n\r\n## The Guided Tours Option:\r\n\r\nThe first solo trip I participated in was through a guided solo-backpacker tour company, called Backpacking Tours, which was formerly known as Backpacking Thailand. The second one I participated in was 3-years later through popular Australian company, Intrepid Travel, which explored Vietnam and Cambodia.\r\n\r\nThe smaller companies, like Backpacking Tours will have less tours running, with less options. This company runs once a month to about 6-destinations, for the allocated time.\r\n\r\nA larger company like Intrepid runs dozens on dozens of trips, monthly, with destinations all over the world, catered to different preferences, such as cycling, or food cultures and are available in various durations, from 8 days to 31 days and everything in between, as an example.\r\n\r\nPros:\r\n\r\n- This is an incredible option for first-time solo travelers, who may be nervous. Through this experience, you will be exposed to hostels\r\n\r\n- You will be visiting places and participating in activities that wouldn’t have otherwise peaked your interest enough to give them a try on your own, or make the arrangements to get there. Over the years, this has challenged me, motivated me, inspired me and more often than not, I am pleasantly surprised and happy to have participated.\r\n\r\n- You will be led by a local guide, who is familiar with the language and the culture. The guide is a great resource in ordering food, translating, offering support, suggestions, etc.\r\n\r\n- You will feel much safer, as you will be with the same guide and group of tourists along the way, which makes for stronger bonds and an increased comfort level.\r\n\r\n- Your local guide will be your go-to and is a valuable resource to have in a foreign country. They will be able to take you to more local spots and experiences off the tourist path, which gives you a more authentic experience.\r\n\r\n- All accommodation, transportation and many of the activities are pre-planned. If they aren't, they'll be outlined-- but these are usually typical benefits of a group trip! This is super convenient as most times, the guide will announce your next-day plans before bed and you just have to wake up and be there! They will deal with the rest!\r\n\r\n- A great option if you are on a time-restriction to plan your trip, or if you decide to go on a whim!\r\n\r\nCons:\r\n\r\n- You are on a schedule, although these groups do typically allocate plenty of free time.\r\n\r\n- The majority of your time will be spent in a group setting. Finding time to have your own space/alone time may be limited.\r\n\r\n- You will be with the same group of people for the duration of your time. You won't meet as many people along the way, as you'll be in a group setting, but the bond with each other will be a great one.\r\n\r\n- You are restricted to the cities/countries/activities which are planned, or offered to you.\r\n\r\n- Ensure you research the group dynamic in advance! Many companies offer under 30 trips to ensure for a great bonding experience. But otherwise, you may have a large age gap in your groups!\r\n\r\n- Group trips are significantly (even drastically) more expensive than if you had done the same trip solo-- especially those in and around SE Asia!\r\n\r\n## The Solo Option:\r\n\r\nPros\r\n\r\n- It is scary and challenging and in turn, liberating to acknowledge what you are capable of.\r\n\r\n- You will be able to spend your time in the ways YOU choose-- you can focus on what is important to you and the personalized experience that you're looking for!\r\n\r\n- You are in the driver's seat of your destiny-- You make the decisions of where to stay, where to visit, what to see, what to do, what to eat!\r\n\r\n- The entire experience is rewarding-- you'll learn how to be a better traveler in how you choose to deal with the situations being handed to you!\r\n\r\nCons\r\n\r\n- Things will go wrong. You'll be dealing with a lot, planning a lot and managing a lot. Unless you're an expert, things will go wrong and they might discourage you.\r\n\r\n- The planning aspect can be significantly more stressful + time consuming.\r\n\r\n- You'll have to navigate everything important-- transportation, food, culture, language, accommodation, finding things to do, maps and navigation, etc.\r\n\r\n- You'll spend a good chunk of time on your trip coordinating your travel life.\r\n\r\nRemember, at the end of the day, only you can make the best decision for you. Chances are, your first solo trip won't be your last, so see how your first one goes and try it again! Every trip, I learn another piece of valuable information to make me a better solo traveler for next time.\r\n"
  },
  {
    "id": 1670994000,
    "titleUrl": "the-benefits-of-backpacking-carry-on-versus-bringing-a-luggage",
    "titleString": "The benefits of backpacking + carry-on, versus bringing a luggage\r",
    "author": "Nadia Greco\r",
    "date": "December 14, 2022\r",
    "image": "example3.jpg\r",
    "content": "\r\nReasons to avoid bringing a luggage on your next trip:\r\n\r\n1. You will save money on flight tickets-- bringing a carry-on is typically free-of-charge, or significantly cheaper than checking a carry-on.\r\n\r\n2. You will not have to wait around and waste time waiting for luggage offload. You can immediately grab your belongings and save 30 minutes-an hour and begin heading to your accommodation.\r\n\r\n3. You will have access to all your belongings on flights.\r\n\r\n4. It will restrict your space, which means that working towards the solo travel minimalism life is much easier when it simply cannot fit!\r\n\r\n5. Hostels often have small/limited storage space. Hostels will often offer those with a larger luggage additional security space, which is often available for an added fee. Not to mention, these storage rooms are never located near your room!\r\n\r\n6. Rolling a luggage through the cobblestoned streets of Czech Republic, or the earthy streets of Vietnam is not a pleasant experience.\r\n\r\n7. If you are moving around, you'll be utilizing a series of transportation, from trains to buses to boats. It only becomes simpler when your belongings are easy to carry around!\r\n\r\nCons:\r\n\r\n1. The overhead storage is typically over-filled and airlines will likely have to check a portion of the overhead luggage.\r\n\r\n2. You will be restricted in space.\r\n\r\n3. You will have to follow liquid and other storage requirements and limitations.\r\n\r\n4. You will have to walk around the airport with all of your belongings for the duration of your waiting time.\r\n\r\n5. You likely won't have all that much room for shopping, or souvenir purchases while abroad.\r\n"
  },
  {
    "id": 1670821200,
    "titleUrl": "banking-and-solo-travel",
    "titleString": "Banking and solo travel\r",
    "author": "Nadia Greco\r",
    "date": "December 12, 2022\r",
    "image": "example1.jpg\r",
    "content": "\r\nPrior to deciding to run free and disappearing to the other side of the world, I had been a banker for seven years. Through that time, I learned a lot of skills to benefit me in the day-to-day. Mostly, I had been grateful that I had learned everything there was to know about a mortgage for when would eventually be the big day.\r\n\r\nLittle did I know, banking would help me chase a whole other dream and do it as money-safe as I could.\r\n\r\nThere was a point in Vietnam, where my cards weren’t allowing me to withdraw any money from my accounts. When I called into the bank, they had said that nothing was wrong and that my account looked fine. I still don’t know what the issue was. But I had tried five ATMs that morning. There was a point where my tour guide had our tour bus go out of its way to go to an area by the mall where there were 4 ATMs in a line and none of them worked. 24-hours later, it was just magically fixed. But I borrowed money from my new friends, I owed money to my tour guide. And here’s why I didn’t panic. Even though not all of this worked in the moment, it would have for various circumstances and eventually, something here would have fixed my problem.\r\n\r\nHere's some things my experiences in banking taught me and some options you have to protect yourself:\r\n\r\n- Get a double debit card – keep them both open. ATMs will often eat your cards and if they do while you’re abroad, you’re in trouble.\r\n- Try to have at least two VISAS, for the same purpose.\r\n- USD VISA – Many countries accept these cards. If anything comes up in USD, you’re set.\r\n- Try to order a foreign currency order to have at least some cash. You can always find an ATM within a 10-minute walk, but I just liked landing and having a bit of all the currencies, so I didn’t have to freak out.\r\n- Ask your bank to add comments to your profile – a lot of banks don’t require this anymore, but every bank employee is able to access these notes on your file, so if something does go wrong, you have a back-up.\r\n- Set up a POA – A power-of-attorney allows someone to act on your behalf, so long as you are well and living. I had my bank set up documents with my mother—which came in handy because in Spain, I got a notification that my cards were blocked. My mom was able to call and sort it out for me from abroad (because I did not have calling service, I had a virtual sim card). Turns out my cards got blocked because I bought an $80 ticket to a flamenco show in Madrid.\r\n- Carry a few hundred dollars of cash in your own currency – If anything goes wrong, there are currency exchange places for emergencies.\r\n- Have a travel VISA. I currently have the following cards from TD Canada Trust: The First Class Travel Infinite and the Aeroplan. Both of these cards give me access to medical insurance, trip cancellation and baggage insurance. There are differences between them, but in addition, there is also hotel burglary insurance, item warranty, etc.\r\n- I haven't ever taken the liberty of exploring my foreign currency options, but I have read not to exchange foreign currency at an airport. I have also heard that it is cheaper to purchase that currency in the country, rather than at an exchange vendor back home.\r\n- Unlike in Canada, you may have to physically provide your card to vendors abroad, where they may take it away to process payment elsewhere. This is a security risk you can't entirely avoid. Make sure to read up on your bank's fraud policies -- with the cards I have and the bank I bank with, I am 100% covered for any fraudulent purchases or transactions that occur on my card.\r\n"
  }
]
